In [1]:
import pandas as pd

In [2]:
# Pandas is from Numpy, So mode of the Things will match Numpy

In [3]:
print(pd.__version__)

1.1.3

In [4]:
A= pd.Series([1,2,3,4],index=['a','b','c','d'])

In [5]:
A

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
A['c']

3

In [7]:
#OR

In [8]:
B= pd.Series([10,20,30,40],index=[5,6,7,8])

In [9]:
B

5    10
6    20
7    30
8    40
dtype: int64

In [10]:
######Cheking Index values
A.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [11]:
# Series is more like Dictionary with 
# index===key
# value = values

# Slicing

In [12]:
#Normal Slicing 
#normal slicing have implicit indices...example.
A[0:2]

a    1
b    2
dtype: int64

In [13]:
#slicing with explicit indices that we have Given 
B=A['a':'c']  # a and c are index , we have given 
B

a    1
b    2
c    3
dtype: int64

# Another way of using Series -->by using Dictionary

In [14]:
grades_dict= {'A':45,'B':67,'C':78,'D':90}  #Dict
grades= pd.Series(grades_dict)
grades

A    45
B    67
C    78
D    90
dtype: int64

In [15]:
X=grades.values
Y=grades.index
print("Values",X)
print("Index",Y)

Values [45 67 78 90]
Index Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
#another Example
marks_dict= {'A':78,'B':79,'C':80,'D':83}  #Dict
marks= pd.Series(marks_dict)
marks

A    78
B    79
C    80
D    83
dtype: int64

# Data frame

In [17]:
D = pd.DataFrame({'Marks': marks,'Grades': grades})
D

   Marks  Grades
A     78      45
B     79      67
C     80      78
D     83      90

In [18]:
# Transpose
D.T

         A   B   C   D
Marks   78  79  80  83
Grades  45  67  78  90

</h3><b> Accessing values in DataFrame </b></h3>

In [19]:
#DataFrame have 3 Parts
#values
#index
#columns

In [20]:
D.values

array([[78, 45],
       [79, 67],
       [80, 78],
       [83, 90]], dtype=int64)

In [21]:
# lets Access 83...same as Numpy
D.values[3,0]

83

In [22]:
D.columns

Index(['Marks', 'Grades'], dtype='object')

In [23]:
D.index

Index(['A', 'B', 'C', 'D'], dtype='object')

<h3><B>Add another columns for scaled marks(marks outof 90)</B></h3>

In [24]:
#Same as Dictionary
D['Scaled Marks']=D['Marks']/100*90

In [25]:
D

   Marks  Grades  Scaled Marks
A     78      45          70.2
B     79      67          71.1
C     80      78          72.0
D     83      90          74.7

In [26]:
# same as Dictinary as it is a dictionary
del D['Scaled Marks']

In [27]:
D

   Marks  Grades
A     78      45
B     79      67
C     80      78
D     83      90

# Masking

In [28]:
# Marks >= 80
# same as Numpy
G= D[D['Marks']>=80]
G

   Marks  Grades
C     80      78
D     83      90

# Pandas(NaN)-->Handle when Some Data is Missing(NaN values)

In [29]:
# here We are creating a DataFrame with 2 Dict 
#under 1 list to understand the concept 
E = pd.DataFrame([{'A':78,'B':67},{'B':56,'C':89}])
E

      A   B     C
0  78.0  67   NaN
1   NaN  56  89.0

In [30]:
#OR
X={'A':78,'B':67}
Y={'B':56,'C':89}
F= pd.DataFrame([X,Y])
F

      A   B     C
0  78.0  67   NaN
1   NaN  56  89.0

In [31]:
# So Solving the NaN values with 2 methods
# way 1. fill Nan values with certain Values
E.fillna(0)

      A   B     C
0  78.0  67   0.0
1   0.0  56  89.0

In [32]:
# Way 2. Delete those records with NaN values
print(F)
F.dropna()
#Here all have NaN values for everything is deleted

      A   B     C
0  78.0  67   NaN
1   NaN  56  89.0

Empty DataFrame
Columns: [A, B, C]
Index: []

In [33]:
# Other ways are not in Pandas
# they in scikit learn and other places

# Problem: what if Explicit indices we supply(1,2,3,4) compiler confused with implicit

In [34]:
data = pd.Series([34,23,12,56,45],index=[1,2,3,4,5])
data

1    34
2    23
3    12
4    56
5    45
dtype: int64

In [35]:
data[1]   #Explicit Index(index that we have Given) will Work

34

In [36]:
#Implicit Index will work but we want to use Explicit index
data[1:3]

2    23
3    12
dtype: int64

In [37]:
# So we have 2 Function for such Reason

<h2>Function->loc(Explicit index) and iloc(Implicit index) </h2>

In [38]:
data.loc[1:3]   #Explicit index

1    34
2    23
3    12
dtype: int64

In [39]:
data.iloc[1:3] #Implicit index

2    23
3    12
dtype: int64

In [44]:
# Slicing same as numpy
D

   Marks  Grades
A     78      45
B     79      67
C     80      78
D     83      90

In [45]:
# A=0 B=1 C=2 for implicit
D.iloc[2,:]

Marks     80
Grades    78
Name: C, dtype: int64

## Other Functions are in Covid_cases Program

# End